tap "algertc/kleopatra4mac"
tap "blackfireio/blackfire"
tap "box-project/box"
tap "buildpacks/tap"
tap "ddev/ddev"
tap "drud/ddev"
tap "f/mcptools"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kabel/php-ext"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "mutagen-io/mutagen"
tap "nicoverbruggen/cask"
tap "paninihouse/brewer-cmd"
tap "pantheon-systems/external"
tap "pantheon-systems/internal", "git@github.com:pantheon-systems/homebrew-internal.git"
tap "ramiawar/dataline"
tap "rdp/openssh-gssapi"
tap "redis-stack/redis-stack"
tap "shivammathur/extensions"
tap "tideways/profiler"
brew "act"
brew "xz"
brew "zstd"
brew "openssl@3"
brew "apr-util"
brew "bash"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "berglas"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "bzip2"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cmake"
brew "cmctl"
brew "rtmpdump"
brew "freetds"
brew "gd"
brew "libzip"
brew "readline"
brew "sqlite"
brew "php", link: false
brew "composer"
brew "dep-tree"
brew "diff-so-fancy"
brew "python@3.13"
brew "docutils"
brew "pango"
brew "duc"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "leptonica"
brew "libb2"
brew "python@3.12"
brew "libass"
brew "librist"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fpart"
brew "fzf"
brew "gawk"
brew "gcc", link: false
brew "gcc@12"
brew "gdk-pixbuf"
brew "gdrive"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-filter-repo"
brew "git-sizer"
brew "glow"
brew "gnu-sed"
brew "libgcrypt"
brew "gnupg"
brew "go"
brew "goaccess"
brew "gpatch"
brew "gpgme"
brew "grafana"
brew "grep"
brew "node"
brew "grunt-cli"
brew "pkgconf"
brew "guile"
brew "hadolint"
brew "hdf5"
brew "hopenpgp-tools"
brew "httpd", restart_service: :changed
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jid"
brew "jq"
brew "k6"
brew "keyring"
brew "libffi"
brew "libfido2"
brew "libmatio"
brew "librsvg"
brew "libxmlsec1"
brew "lla"
brew "mackup"
brew "markdownlint-cli"
brew "mcfly"
brew "mtr"
brew "mydumper"
brew "zlib"
brew "mysql-client@8.0"
brew "mysql@8.0", restart_service: :changed
brew "mysqltuner"
brew "newrelic-cli"
brew "nghttp2"
brew "nnn"
brew "openblas"
brew "numpy"
brew "nvm"
brew "open-mpi"
brew "pandoc"
brew "parallel"
brew "pcre"
brew "percona-toolkit"
brew "perl"
brew "php@8.1", restart_service: :changed
brew "php@8.2", restart_service: :changed, link: true
brew "php@8.3", restart_service: :changed
brew "pigz"
brew "pinentry-mac"
brew "poppler"
brew "pure"
brew "pv"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "rdb"
brew "redis", restart_service: :changed
brew "rsync"
brew "rust"
brew "shellcheck"
brew "siege"
brew "sphinx-doc"
brew "tcl-tk@8"
brew "thefuck"
brew "tree"
brew "uv"
brew "virtualenv"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "yq"
brew "zsh-syntax-highlighting"
brew "box-project/box/box"
brew "buildpacks/tap/pack"
brew "ddev/ddev/ddev"
brew "f/mcptools/mcp"
brew "gromgit/fuse/s3fs-mac"
brew "pantheon-systems/external/terminus"
brew "pantheon-systems/internal/pants"
brew "pantheon-systems/internal/server-tool"
brew "ramiawar/dataline/dataline"
brew "shivammathur/extensions/apcu@8.2"
brew "shivammathur/extensions/mcrypt@8.2"
brew "shivammathur/extensions/pcov@7.4"
brew "shivammathur/extensions/pcov@8.1"
brew "shivammathur/extensions/redis@8.2"
cask "basictex"
cask "git-credential-manager"
cask "gitkraken-cli"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "iterm2"
cask "maccy"
cask "mark-text"
cask "markdown-service-tools"
cask "ngrok"
cask "orbstack"
cask "redis-stack-server"
cask "sequel-ace"
cask "sloth"
cask "stats"
cask "syntax-highlight"
cask "xquartz"
vscode "alefragnani.bookmarks"
vscode "alphaxek.github-actions-locally"
vscode "benjaminbenais.copilot-theme"
vscode "bmewburn.vscode-intelephense-client"
vscode "codestream.codestream"
vscode "daylerees.rainglow"
vscode "dbcode.dbcode"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "evondev.dracula-high-contrast"
vscode "formulahendry.github-actions"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "huizhou.githd"
vscode "ibm.output-colorizer"
vscode "ikappas.composer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.vscode-peacock"
vscode "liviuschera.noctis"
vscode "lkytal.flatui"
vscode "mariorodeghiero.vue-theme"
vscode "mathcale.theme-dracula-refined"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "neilbrayfield.php-docblocker"
vscode "omartawfik.github-actions-vscode"
vscode "openai.openai-chatgpt-adhoc"
vscode "paulvarache.vscode-taskfile"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "shaharkazaz.git-merger"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "swashata.beautiful-ui"
vscode "swimm.swimm"
vscode "tejasvi.rainbow-brackets-2"
vscode "timonwong.shellcheck"
vscode "uloco.theme-bluloco-dark"
vscode "vsls-contrib.gistfs"
vscode "waderyan.gitblame"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
