# =============================================================================
# Brewfile.laptop — Laptop-specific packages
# =============================================================================
# GUI apps, VS Code extensions, dev tooling.
# Generated from: brew bundle dump + code --list-extensions

# --- Taps ---
tap "buildpacks/tap"
tap "ddev/ddev"
tap "entireio/tap"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "milisp/mcp-linker"
tap "minio/stable"
tap "oldjii/tap"
tap "oven-sh/bun"
tap "surrealdb/tap"
tap "timrogers/tap"
tap "tomyan/tap"
tap "waydabber/betterdisplay"

# --- Database clients ---
brew "apr-util"
brew "freetds"
brew "mysql-client"
brew "mysql-client@8.4"
brew "mysqltuner"
brew "mydumper"
brew "dumpling"
brew "percona-toolkit"
brew "redis", restart_service: :changed

# --- Web ---
brew "httpd", restart_service: :changed

# --- Monitoring ---
brew "grafana"
brew "goaccess"
brew "mole"

# --- Language servers / dev tools ---
brew "bash-language-server"
brew "llvm"
brew "lld"

# --- AI / ML ---
brew "ollama"

# --- Utilities ---
brew "cmctl"
brew "dos2unix"
brew "hopenpgp-tools"
brew "litra"
brew "rtk"

# --- Custom tap formulae ---
brew "surrealdb/tap/surreal"
brew "timrogers/tap/litra-autotoggle"
brew "tomyan/tap/hubcap"
brew "waydabber/betterdisplay/betterdisplaycli"

# --- GUI apps ---
cask "bloom"
cask "claude-code"
cask "entireio/tap/entire"
cask "ghostty"
cask "gpg-suite"
cask "iterm2"
cask "maccy"
cask "milisp/mcp-linker/mcp-linker"
cask "ngrok"
cask "orbstack"
cask "pearcleaner"
cask "qlmarkdown"
cask "raycast"
cask "sequel-ace"
cask "visual-studio-code"

# --- Nerd fonts (beyond hack/jetbrains/meslo in common Brewfile) ---
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-adwaita-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-atkynson-mono-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"

# --- VS Code extensions ---
vscode "agsoft.claude-history-viewer"
vscode "anthropic.claude-code"
vscode "augment.vscode-augment"
vscode "biati.ddev-manager"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codeviz.codeviz"
vscode "dandric.vscode-jq"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "detachhead.basedpyright"
vscode "drewipson.claude-code-config"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hverlin.mise-vscode"
vscode "ikappas.composer"
vscode "joelalejandro.nrql-language"
vscode "johnpapa.vscode-peacock"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "kilocode.kilo-code"
vscode "mbehr1.vsc-lfs"
vscode "mechatroner.rainbow-csv"
vscode "mehyaa.workspace-storage-cleanup"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "mtxr.sqltools"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "sleistner.vscode-fileutils"
vscode "stanislav.vscode-drupal"
vscode "tamasfe.even-better-toml"
vscode "thomas-baumgaertner.vcl"
vscode "timonwong.shellcheck"
vscode "vexp.vexp-vscode"
vscode "waderyan.gitblame"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zobo.php-intellisense"
