# =============================================================================
# Brewfile.laptop — Laptop-specific packages
# =============================================================================
# GUI apps, VS Code extensions, dev tooling.
# Rebuilt from actual brew list + code --list-extensions output.

# --- Database clients ---
brew "apr-util"
brew "freetds"
brew "mysql-client"
brew "mysql-client@8.4"
brew "mysqltuner"
brew "mydumper"
brew "dumpling"
brew "percona-toolkit"
brew "redis", restart_service: :changed

# --- Web ---
brew "httpd", restart_service: :changed

# --- Monitoring ---
brew "grafana"
brew "goaccess"
brew "mole"

# --- Utilities ---
brew "dos2unix"

# --- GUI apps ---
cask "bloom"
cask "claude-code"
cask "ghostty"
cask "gpg-suite"
cask "iterm2"
cask "maccy"
cask "ngrok"
cask "orbstack"
cask "pearcleaner"
cask "qlmarkdown"
cask "raycast"
cask "sequel-ace"
cask "syntax-highlight"
cask "visual-studio-code"

# --- VS Code extensions ---
anthropic.claude-code
augment.vscode-augment
biati.ddev-manager
charliermarsh.ruff
christian-kohler.npm-intellisense
codeviz.codeviz
dandric.vscode-jq
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
detachhead.basedpyright
drewipson.claude-code-config
dustypomerleau.rust-syntax
esbenp.prettier-vscode
fastly.vscode-fastly-vcl
foxundermoon.shell-format
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
golang.go
hverlin.mise-vscode
ikappas.composer
joelalejandro.nrql-language
johnpapa.vscode-peacock
jq-syntax-highlighting.jq-syntax-highlighting
kaleidoscope-app.vscode-ksdiff
kilocode.kilo-code
mbehr1.vsc-lfs
mechatroner.rainbow-csv
mehyaa.workspace-storage-cleanup
mermaidchart.vscode-mermaid-chart
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.extension-test-runner
ms-vscode.vscode-websearchforcopilot
mtxr.sqltools
patbenatar.advanced-new-file
pkief.material-icon-theme
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
samuelcolvin.jinjahtml
sleistner.vscode-fileutils
stanislav.vscode-drupal
tamasfe.even-better-toml
thomas-baumgaertner.vcl
timonwong.shellcheck
waderyan.gitblame
xdebug.php-debug
xdebug.php-pack
yzhang.markdown-all-in-one
zainchen.json
zobo.php-intellisense
