tap "algertc/kleopatra4mac"
tap "blackfireio/blackfire"
tap "box-project/box"
tap "buildpacks/tap"
tap "ddev/ddev"
tap "drud/ddev"
tap "f/mcptools"
tap "gromgit/fuse"
tap "kabel/php-ext"
tap "koekeishiya/formulae"
tap "madappgang/claudish"
tap "microsoft/git"
tap "mutagen-io/mutagen"
tap "nicoverbruggen/cask"
tap "paninihouse/brewer-cmd"
tap "pantheon-systems/external"
tap "pantheon-systems/internal", "git@github.com:pantheon-systems/homebrew-internal.git"
tap "ramiawar/dataline"
tap "rdp/openssh-gssapi"
tap "redis-stack/redis-stack"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "tideways/profiler"
tap "timothebot/tap"
brew "act"
brew "aha"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "xz"
brew "zstd"
brew "openjdk"
brew "allure"
brew "openssl@3"
brew "apr-util"
brew "ast-grep"
brew "bash"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "bc"
brew "berglas"
brew "bfg"
brew "bzip2"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cmake"
brew "cmctl"
brew "code2prompt"
brew "rtmpdump"
brew "curl"
brew "freetds"
brew "gd"
brew "libzip"
brew "composer"
brew "dep-tree"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "python@3.14"
brew "docutils"
brew "pango"
brew "duc"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "leptonica"
brew "libb2"
brew "libass"
brew "librist"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "flock"
brew "fpart"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gcc@12"
brew "gdk-pixbuf"
brew "gdrive"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "python@3.13"
brew "git-filter-repo"
brew "git-sizer"
brew "glow"
brew "gnu-sed"
brew "libgcrypt"
brew "gnupg"
brew "go"
brew "goaccess"
brew "gpatch"
brew "gpgme"
brew "grafana"
brew "grep"
brew "grunt-cli"
brew "pkgconf"
brew "guile"
brew "gum"
brew "hadolint"
brew "hdf5"
brew "hopenpgp-tools"
brew "htop"
brew "httpd", restart_service: :changed
brew "hyperfine"
brew "libheif"
brew "libraw"
brew "librsvg"
brew "imagemagick"
brew "jid"
brew "jq"
brew "k6"
brew "keyring"
brew "libffi"
brew "libfido2"
brew "libmatio"
brew "libxmlsec1"
brew "lla"
brew "lynx"
brew "mackup"
brew "markdownlint-cli"
brew "mcfly"
brew "mise"
brew "mkcert"
brew "mole"
brew "mtr"
brew "zlib"
brew "mysql-client@8.4", link: true
brew "mysql@8.4", restart_service: :changed
brew "mysqltuner"
brew "neo4j"
brew "newrelic-cli"
brew "nghttp2"
brew "nnn"
brew "nss"
brew "numpy", link: false
brew "nvm"
brew "ollama", restart_service: :changed
brew "open-mpi"
brew "pandoc"
brew "parallel"
brew "pcre"
brew "percona-toolkit"
brew "perl"
brew "php@8.1"
brew "php@8.2", restart_service: :changed
brew "php@8.3", restart_service: :changed, link: true
brew "pigz"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "poppler"
brew "postgresql@15", restart_service: :changed
brew "postgresql@16"
brew "powerlevel10k"
brew "pure"
brew "pv"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "redis", restart_service: :changed
brew "repomix"
brew "ripgrep"
brew "ripmime"
brew "rsync"
brew "shellcheck"
brew "siege"
brew "slackdump"
brew "smartmontools"
brew "sphinx-doc"
brew "starship"
brew "tcl-tk@8"
brew "thefuck"
brew "tmux"
brew "tree"
brew "uv"
brew "virtualenv"
brew "watch"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "buildpacks/tap/pack"
brew "ddev/ddev/ddev"
brew "f/mcptools/mcp"
brew "pantheon-systems/internal/kubits"
brew "pantheon-systems/internal/pants"
brew "ramiawar/dataline/dataline"
brew "shivammathur/extensions/pcov@8.1"
brew "timothebot/tap/lacy"
cask "basictex"
cask "bloom"
cask "claude-code"
cask "claudish"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gcloud-cli"
cask "git-credential-manager"
cask "gpg-suite"
cask "iterm2"
cask "maccy"
cask "markdown-service-tools"
cask "ngrok"
cask "orbstack"
cask "raycast"
cask "redis-stack-server"
cask "sequel-ace"
cask "shortcutdetective"
cask "stats"
cask "stravu-crystal"
cask "swift-shift"
cask "visual-studio-code"
cask "xquartz"
vscode "agsoft.claude-history-viewer"
vscode "aizenvolt.claude-unbound"
vscode "ankitcode.firefly"
vscode "anthropic.claude-code"
vscode "augment.vscode-augment"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bbeversdorf.drupal-check"
vscode "beardedbear.beardedtheme"
vscode "benjaminbenais.copilot-theme"
vscode "biati.ddev-manager"
vscode "bmewburn.vscode-intelephense-client"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codeviz.codeviz"
vscode "codevizai.codevizai"
vscode "cweijan.vscode-mysql-client2"
vscode "dandric.vscode-jq"
vscode "davidanson.vscode-markdownlint"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "dbcode.dbcode"
vscode "deepmyst.mysti"
vscode "devgom.claude-dev-helper"
vscode "diruuu.claude-code-sidebar"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "drewipson.claude-code-config"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "fastly.vscode-fastly-vcl"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "hverlin.mise-vscode"
vscode "ibm.output-colorizer"
vscode "ikappas.composer"
vscode "iliazeus.vscode-ansi"
vscode "jdinhlife.gruvbox"
vscode "joelalejandro.nrql-language"
vscode "johnpapa.vscode-peacock"
vscode "jpegg-dev.claude-code-settings-helper"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "kilocode.kilo-code"
vscode "kingleo.unzip"
vscode "linda-cheung.content-menu-item-refresh"
vscode "lumirelle.shell-format-rev"
vscode "m-tech.theme-m-tech-vscode"
vscode "mbehr1.vsc-lfs"
vscode "mechatroner.rainbow-csv"
vscode "memorylovers.sortable-explorer"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.copilot-mermaid-diagram"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "mtxr.sqltools"
vscode "patbenatar.advanced-new-file"
vscode "phoihos.csv-to-md-table"
vscode "pkief.material-icon-theme"
vscode "pombadev.pbbs"
vscode "ranathedev.smart-index-updater"
vscode "redhat.vscode-xml"
vscode "redis.redis-for-vscode"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "sahilkumardev.villan-theam"
vscode "skezu.ai-rules-converter"
vscode "sleistner.vscode-fileutils"
vscode "stanislav.vscode-drupal"
vscode "stumpworks.claude-restarter"
vscode "thomas-baumgaertner.vcl"
vscode "timonwong.shellcheck"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "vstirbu.vscode-mermaid-preview"
vscode "vxplain.vxplain"
vscode "waderyan.gitblame"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zencoderai.zencoder"
vscode "ziyasal.vscode-open-in-github"
vscode "zobo.php-intellisense"
go "cmd/go"
go "cmd/gofmt"
cargo "ngxav"
