tap "blackfireio/blackfire"
tap "box-project/box"
tap "buildpacks/tap"
tap "cantino/mcfly"
tap "ddev/ddev"
tap "fastly/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "minio/stable"
tap "sourcegraph/src-cli"
brew "libpng"
brew "xz"
brew "zstd"
brew "openssl@3"
brew "apr-util"
brew "atuin"
brew "autoconf"
brew "automake"
brew "bison"
brew "bzip2"
brew "freetype"
brew "gettext"
brew "glib"
brew "cmctl"
brew "gmp"
brew "coreutils"
brew "libssh2"
brew "curl"
brew "dumpling"
brew "ffmpeg"
brew "fpart"
brew "freetds"
brew "gcc"
brew "webp"
brew "gd"
brew "libiconv"
brew "git"
brew "oniguruma"
brew "git-delta"
brew "git-filter-repo"
brew "git-sizer"
brew "unbound"
brew "gnutls"
brew "libgcrypt"
brew "readline"
brew "gnupg"
brew "goaccess"
brew "gpatch"
brew "grafana"
brew "pkgconf"
brew "guile"
brew "icu4c@78"
brew "harfbuzz"
brew "hopenpgp-tools"
brew "httpd", restart_service: :changed
brew "libheif"
brew "imagemagick"
brew "jpeg"
brew "krb5"
brew "lbzip2"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libedit"
brew "libffi"
brew "libraw"
brew "pango"
brew "librsvg"
brew "libsodium"
brew "libxml2"
brew "libxmlsec1"
brew "libyaml"
brew "libzip"
brew "mise"
brew "mole"
brew "mydumper"
brew "mysql-client"
brew "mysql-client@8.4"
brew "mysqltuner"
brew "nghttp2"
brew "openblas"
brew "numpy"
brew "parallel"
brew "pcre"
brew "percona-toolkit"
brew "pigz"
brew "pinentry-mac"
brew "poppler"
brew "py3cairo"
brew "re2c"
brew "redis", restart_service: :changed
brew "rsync"
brew "rtmpdump"
brew "srt"
brew "tag"
brew "tesseract"
brew "tree"
brew "vips"
brew "wget"
brew "zlib"
brew "zsh-syntax-highlighting"
cask "bloom"
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "gpg-suite"
cask "iterm2"
cask "maccy"
cask "ngrok"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "sequel-ace"
vscode "agsoft.claude-history-viewer"
vscode "ankitcode.firefly"
vscode "anthropic.claude-code"
vscode "augment.vscode-augment"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bbeversdorf.drupal-check"
vscode "beardedbear.beardedtheme"
vscode "benjaminbenais.copilot-theme"
vscode "biati.ddev-manager"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codeviz.codeviz"
vscode "codevizai.codevizai"
vscode "cweijan.vscode-mysql-client2"
vscode "dandric.vscode-jq"
vscode "davidanson.vscode-markdownlint"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "dbcode.dbcode"
vscode "deepmyst.mysti"
vscode "diruuu.claude-code-sidebar"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "drewipson.claude-code-config"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "fastly.vscode-fastly-vcl"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "hs7.git-diff"
vscode "hverlin.mise-vscode"
vscode "ibm.output-colorizer"
vscode "ikappas.composer"
vscode "iliazeus.vscode-ansi"
vscode "jdinhlife.gruvbox"
vscode "jerriepelser.copy-markdown-as-html"
vscode "joelalejandro.nrql-language"
vscode "johnpapa.vscode-peacock"
vscode "jpegg-dev.claude-code-settings-helper"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "kilocode.kilo-code"
vscode "kingleo.unzip"
vscode "linda-cheung.content-menu-item-refresh"
vscode "lumirelle.shell-format-rev"
vscode "m-tech.theme-m-tech-vscode"
vscode "mbehr1.vsc-lfs"
vscode "mechatroner.rainbow-csv"
vscode "memorylovers.sortable-explorer"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.copilot-mermaid-diagram"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "mtxr.sqltools"
vscode "patbenatar.advanced-new-file"
vscode "phoihos.csv-to-md-table"
vscode "pkief.material-icon-theme"
vscode "pombadev.pbbs"
vscode "pomber.git-file-history"
vscode "ranathedev.smart-index-updater"
vscode "redhat.vscode-xml"
vscode "redis.redis-for-vscode"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "sahilkumardev.villan-theam"
vscode "samuelcolvin.jinjahtml"
vscode "skezu.ai-rules-converter"
vscode "sleistner.vscode-fileutils"
vscode "stanislav.vscode-drupal"
vscode "stumpworks.claude-restarter"
vscode "tamasfe.even-better-toml"
vscode "thomas-baumgaertner.vcl"
vscode "timonwong.shellcheck"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "vsls-contrib.gistfs"
vscode "vstirbu.vscode-mermaid-preview"
vscode "vxplain.vxplain"
vscode "waderyan.gitblame"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zencoderai.zencoder"
vscode "ziyasal.vscode-open-in-github"
vscode "zobo.php-intellisense"
go "cmd/go"
go "cmd/gofmt"
